In [1]:
import pandas as pd
import numpy as np

"""It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
"""
"""#1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)."""

df= pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                                'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                                'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                                'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                                            '12. Air France', '"Swiss Air"']})
print(df)
#Settingup index value for Flighnumber increase by 10
SetIndex1=np.arange(1,df.From_To.count()+1)

df.set_index(SetIndex1,inplace=True)
for i in np.arange(1,df.From_To.count()+1):
    if pd.isnull(df.FlightNumber.loc[i]):
        df.loc[i,'FlightNumber']=df.FlightNumber.loc[i-1]+10
print(df)
df['FlightNumber'].astype(int)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int32

In [2]:

'''2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.'''
print(df['From_To'])
print('--------------------------')
Temp_df2=df.copy()

Temp_df2[['From','To']]=Temp_df2.From_To.str.split("_", expand=True)
#temprory DataDrame
print(Temp_df2)

1        LoNDon_paris
2        MAdrid_miLAN
3    londON_StockhOlm
4      Budapest_PaRis
5     Brussels_londOn
Name: From_To, dtype: object
--------------------------
            From_To  FlightNumber  RecentDelays              Airline  \
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

       From         To
1    LoNDon      paris
2    MAdrid      miLAN
3    londON  StockhOlm
4  Budapest      PaRis
5  Brussels     londOn

In [3]:
'''3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)'''

Temp_df2.From=Temp_df2.From.str.capitalize()
Temp_df2.To=Temp_df2.To.str.capitalize()
Temp_df2.From_To=Temp_df2.From_To.str.capitalize()

print(Temp_df2)

            From_To  FlightNumber  RecentDelays              Airline  \
1      London_paris       10045.0      [23, 47]               KLM(!)
2      Madrid_milan       10055.0            []    <Air France> (12)
3  London_stockholm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_paris       10075.0          [13]       12. Air France
5   Brussels_london       10085.0      [67, 32]          "Swiss Air"

       From         To
1    London      Paris
2    Madrid      Milan
3    London  Stockholm
4  Budapest      Paris
5  Brussels     London

In [4]:
'''4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.'''
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
#deleteing permanently FromTo Col
df.drop(['From_To'],axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
1       10045.0      [23, 47]               KLM(!)
2       10055.0            []    <Air France> (12)
3       10065.0  [24, 43, 87]  (British Airways. )
4       10075.0          [13]       12. Air France
5       10085.0      [67, 32]          "Swiss Air"

In [6]:
#Adding From to columns from Temprory files

df['From_To']=Temp_df2['From_To']
df

   FlightNumber  RecentDelays              Airline           From_To
1       10045.0      [23, 47]               KLM(!)      London_paris
2       10055.0            []    <Air France> (12)      Madrid_milan
3       10065.0  [24, 43, 87]  (British Airways. )  London_stockholm
4       10075.0          [13]       12. Air France    Budapest_paris
5       10085.0      [67, 32]          "Swiss Air"   Brussels_london

In [7]:
'''5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.'''
#bringing Recent delays column as per requirent 
df5=pd.DataFrame(df['RecentDelays'].values.tolist())
len_col=df5.shape[1]
print("total columns",len_col)
df5.columns[0]
print("\n----Recent Delay columns list split---:\n\n",df5)
'''Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.'''
col_list=[]
col_dict={}
for i in range(len_col):
    Key=df5.columns[i]
    #print(key,i)
    Value="Delay"+str(i+1)
    col_dict[Key]=Value
df5.rename(columns=col_dict,inplace=True)
print("\n----Replaced column names to delays columns----\n:",df5)

total columns 3

----Recent Delay columns list split---:

       0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

----Replaced column names to delays columns----
:    Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [8]:
print("\n----updated datafrom with delays ----\n:",df)

----updated datafrom with delays ----
:    FlightNumber  RecentDelays              Airline           From_To
1       10045.0      [23, 47]               KLM(!)      London_paris
2       10055.0            []    <Air France> (12)      Madrid_milan
3       10065.0  [24, 43, 87]  (British Airways. )  London_stockholm
4       10075.0          [13]       12. Air France    Budapest_paris
5       10085.0      [67, 32]          "Swiss Air"   Brussels_london

In [13]:
df[["Delay1","Delay2","Delay3"]]=df5[["Delay1","Delay2","Delay3"]]
print("----updated datafrom with delays ----\n:")
print(df)

----updated datafrom with delays ----
:
   FlightNumber  RecentDelays              Airline           From_To  Delay1  \
1       10045.0      [23, 47]               KLM(!)      London_paris     NaN
2       10055.0            []    <Air France> (12)      Madrid_milan    24.0
3       10065.0  [24, 43, 87]  (British Airways. )  London_stockholm    13.0
4       10075.0          [13]       12. Air France    Budapest_paris    67.0
5       10085.0      [67, 32]          "Swiss Air"   Brussels_london     NaN

   Delay2  Delay3
1     NaN     NaN
2    43.0    87.0
3     NaN     NaN
4    32.0     NaN
5     NaN     NaN

In [14]:
#dropping Recent delay column
df.drop('RecentDelays',axis=1,inplace=True)
print("----updated datafrom with delays ----\n:",df)

----updated datafrom with delays ----
:    FlightNumber              Airline           From_To  Delay1  Delay2  Delay3
1       10045.0               KLM(!)      London_paris     NaN     NaN     NaN
2       10055.0    <Air France> (12)      Madrid_milan    24.0    43.0    87.0
3       10065.0  (British Airways. )  London_stockholm    13.0     NaN     NaN
4       10075.0       12. Air France    Budapest_paris    67.0    32.0     NaN
5       10085.0          "Swiss Air"   Brussels_london     NaN     NaN     NaN